Lab7_php_ci/ci4/app/Controllers/Artikel.php

    public function index()
   {
    $title = 'Daftar Artikel';
    $model = new ArtikelModel();
    $artikel = $model->findAll();
---
SELECT *
FROM `artikel`

    public function admin_index()
   {
      $title = 'Daftar Artikel';
      $q = $this->request->getVar('q') ?? '';
      $model = new ArtikelModel();
      $data = [
          'title'   => $title,
          'q'       => $q,
          'artikel' => $model->like('judul', $q)->paginate(4, 'bootstrap'), #data dibatasi 4 record perhalaman
---
SELECT *
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'